In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('sample_data.csv')
df

     Name   Age           City   Salary  Is_Employed
0    John  30.0       New York      NaN         True
1    Jane  25.0    Los Angeles  50000.0        False
2     NaN  40.0        Chicago  60000.0         True
3    Mike  35.0            NaN  70000.0        False
4   Emily   NaN        Houston  80000.0         True
5   David  45.0        Phoenix      NaN        False
6   Sarah  30.0         Dallas  55000.0         True
7   Chris  25.0        Seattle  65000.0        False
8     NaN  40.0         Denver  75000.0         True
9  Olivia  35.0  San Francisco      NaN        False

In [6]:
# 1. Get row Data
df.loc[4]

Name             Emily
Age                NaN
City           Houston
Salary         80000.0
Is_Employed       True
Name: 4, dtype: object

In [8]:
# 2. Get Specific cell from data frame
df.loc[5, 'Salary']

nan

In [9]:
# Get subset of the data
df.loc[[2, 5], ['Age', 'Salary']]

    Age   Salary
2  40.0  60000.0
5  45.0      NaN

## Part Number 2
## Drop functionality

In [13]:
df = pd.DataFrame(
    {
        'name': ['Mohamed', 'Ibrahim', 'Fatima'],
        'age': [12, 44, 56],
        'country': ["Algeria", "UK", "Australia"]
    }
)
df

      name  age    country
0  Mohamed   12    Algeria
1  Ibrahim   44         UK
2   Fatima   56  Australia

In [18]:
# Dropping single column data
dropped_data = df.drop(columns=["age"])
dropped_data

      name    country
0  Mohamed    Algeria
1  Ibrahim         UK
2   Fatima  Australia

In [16]:
# Drop multi-columns data
df_dropped = df.drop(columns=["name", "country"])
df_dropped

   age
0   12
1   44
2   56

In [20]:
df

      name  age    country
0  Mohamed   12    Algeria
1  Ibrahim   44         UK
2   Fatima   56  Australia

In [19]:
# drop a single row by index
df_dropped = df.drop(index=[1])
df_dropped

      name  age    country
0  Mohamed   12    Algeria
2   Fatima   56  Australia

In [24]:
# Drop multi-rows
df_dropped = df.drop(index=[0,2])
df_dropped

      name  age country
1  Ibrahim   44      UK

In [25]:
# Dropping multi-rows using axis
# 0: drop rows
# 1: drop columns

In [27]:
df

      name  age    country
0  Mohamed   12    Algeria
1  Ibrahim   44         UK
2   Fatima   56  Australia

In [26]:
df_drop = df.drop('country', axis=1)
df_drop

      name  age
0  Mohamed   12
1  Ibrahim   44
2   Fatima   56

In [31]:
df_drop = df.drop(1, axis=0)
df_drop

      name  age    country
0  Mohamed   12    Algeria
2   Fatima   56  Australia

In [32]:
# dropping duplication

In [33]:
df = pd.DataFrame({
    'name': ['Mohamed', 'Ibrahim', 'Fatima', 'Ibrahim'],
    'age': [12, 44, 56, 99],
    'country': ["Algeria", "UK", "Australia", "UK"]
})
df

      name  age    country
0  Mohamed   12    Algeria
1  Ibrahim   44         UK
2   Fatima   56  Australia
3  Ibrahim   99         UK

In [35]:
df_dropped = df.drop_duplicates(subset=['name'])
df_dropped

      name  age    country
0  Mohamed   12    Algeria
1  Ibrahim   44         UK
2   Fatima   56  Australia

In [39]:
# Dropping missing values
df = pd.DataFrame({
    'name': [None, 'Ibrahim', 'Fatima', 'Ibrahim'],
    'age': [12, 44, None, 99],
    'country': ["Algeria", "UK", np.nan, "UK"]
})
df

      name   age  country
0     None  12.0  Algeria
1  Ibrahim  44.0       UK
2   Fatima   NaN      NaN
3  Ibrahim  99.0       UK

In [37]:
df_dropped = df.dropna()

In [38]:
df_dropped

      name   age country
1  Ibrahim  44.0      UK
3  Ibrahim  99.0      UK

# Conclution

In [ ]:
# labels: Name of the rows/column to drop
# axis: 0 to drop rows, 1 to drop column
# inplace: Specify row/columns to drop the duplication